// Առաջադրանքներ՝
// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 1 : Ունենք 2 prompt`
// Առաջին prompt-ում մուտքագրվում թիվը, իսկ երկրորդում թվի աստիճանը, հաշվել մուտքագրված թվի համապատասխան աստիճանը
// Օրինակ՝ 4,2 թվերի դեպքում արդյունքը կլինի՝  4^2=16


let prompt_a1, prompt_b1, prompt_r1;

alert("Ծրագիր - թվի աստիճանը հաշվելու համար")
prompt_a1 = Number(prompt("մուտքագրվեք թիվ"));
prompt_b1 = Number(prompt("մուտքագրվեք թվի աստիճանը"));

prompt_r1 = prompt_a1 ** prompt_b1;
alert("Արդյունք: " + prompt_r1);


// Հուշում՝  Խնդրի լուծման համար կարելի է օգտագործել JavaScript Math գրադարանը

// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 2 : Ունենք 2 prompt`
// prompt-երում մուտքագրվում են թվեր: Առաջինում մուտքագրվում է թիվը, իսկ երկրորդում տոկոսը ։ Ցուցադրել թվի տոկոսը
// Օրինակ՝ 150 000  և  50 - ի դեպքում կցուցադրվի 150 000-ի 50 % - ը, այսինքն` 150000*50/100 = 7500։


let prompt_a2, prompt_b2, prompt_r2;

alert("Ծրագիր - թվի տոկոսը հաշվելու համար")
prompt_a2 = Number(prompt("մուտքագրվեք թիվ"));
prompt_b2 = Number(prompt("մուտքագրվեք թվի տոկոսը"));

prompt_r2 = prompt_a2 * prompt_b2 / 100;
alert("Արդյունք: " + prompt_r2);


// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 3 : Ունենք 3 prompt`
// prompt - երում մուտքագրվում են թվեր, ստուգել այդ թվերից ուղղանկյուն եռանկյուն կարող է կառուցվել թե ոչ
// Օրինակ՝ 3,4,5 - ի դեպքում ցույց կտրվի դրական պատասխան,քանի որ թվերը դրական են  և 3**2 + 4**2 = 5**2, մնացյալ դեպքերում  ցույց կտրվի error։


let prompt_a3, prompt_b3,  prompt_c3, prompt_r3;

alert("Ծրագիր - ստուգել մուտքագրված թվերից ուղղանկյուն եռանկյուն կարող է կառուցվել թե ոչ")
prompt_a3 = Number(prompt("մուտքագրվեք թիվ"));
prompt_b3 = Number(prompt("մուտքագրվեք թվի"));
prompt_c3 = Number(prompt("մուտքագրվեք թվի"));

prompt_a3 = prompt_a3 ** 2;
prompt_b3 = prompt_b3 ** 2;
prompt_c3 = prompt_c3 ** 2; 

if ( (prompt_a3 + prompt_b3 == prompt_c3) || ( prompt_a3 + prompt_c3 == prompt_b3 ) || ( prompt_b3 + prompt_c3 == prompt_a3 ) ) {
  alert("Այո, մուտքագրված թվերից ուղղանկյուն եռանկյուն կարող է կառուցվել");
} else {
  alert("Ոչ, մուտքագրված թվերից ուղղանկյուն եռանկյուն չի կարող կառուցվել");
}


// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 4 : Ունենք prompt, որտեղ մուտքագրվում է թիվ
// Ցուցադրել՝ արդյո՞ք տվյալ թիվը երկնիշ է, թե ոչ (օգտվել && օպերատորից)


alert("Ծրագիր - արդյո՞ք թիվը երկնիշ է, թե ոչ")
let prompt_a4 = Number(prompt("մուտքագրվեք թիվ"));

if ( prompt_a4 >= 10 && prompt_a4 <100 )  {
  alert("Այո, թիվը երկնիշ է");
} else if ( prompt_a4 <= -10 && prompt_a4 > -100 ) {  
  alert("Այո, բացասական բայց թիվը երկնիշ է");
} else {
  alert("Ոչ, թիվը երկնիշ չէ");
}


// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// ԱՌԱՋԱԴՐԱՆՔ 5 : Ունենք 3 prompt, որտեղ գրվում են թվեր
// let a = prompt('Enter first Number: ');
// let b = prompt('Enter second Number: ');
// let c = prompt('Enter thrid Number: ');
// ստուգել՝ արդյո՞ք բոլոր թվերը հավասար են իրար 
// ստուգել՝ արդյո՞ք բոլոր թվերը հավասար են 0 -ի
// ստուգել՝ արդյո՞ք կա գոնե մեկ թիվ, որը հավասար է 0 -ի 
// մուտքագրված երեք թվերը տպել console - ում դասավորված աճման կարգով


let a = Number(prompt("Enter first Number: "));
let b = Number(prompt("Enter second Number: "));
let c = Number(prompt("Enter thrid Number: "));

let max_r = Math.max(a, b, c);
let min_r = Math.min(a, b, c);
let mij_r = ((a + b + c) - (max_r + min_r));

if (a == b && b == c && c == 0) {
  alert("Բոլոր թվերը հավասար են 0 -ի");
} else if (a == b && b == c) {
  alert("Բոլոր թվերը հավասար են իրար");
} else if (a == 0 || b ==0 || c ==0) {
  alert("Կա գոնե մեկ թիվ, որը հավասար է 0 -ի");
} else {
  alert("...") 
}

console.log("Թվերը դասավորված աճման կարգով: " + min_r + " " + mij_r + " " + max_r);


// ՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝՝
// Լրացուցիչ առաջադրանք՝
// Ունենք prompt`
// prompt - ում մուտքագրվում է վայրկյանների քանակը, մուտքագրված վայրկյանները ձևափոխել օր/ժամ/րոպե/վայրկյան տեսքի և տպել.
// Օրինակ՝ 187801 վայրկյանի դեպքում արդյունքը կլինի՝ 2 օր, 4 ժամ, 10 րոպե, 1 վայրկյան

alert("Ծրագիր - մուտքագրված վայրկյանները, ձևափոխել օր/ժամ/րոպե/վայրկյան տեսքի")

let data0 = Number(prompt("մուտքագրվեք թիվ"));



let data_modul_day = data0 % 86400;
let data_day = (data0 - data_modul_day) / 86400 ;

let data_modul_hour = data_modul_day % 3600;
let data_hour = (data_modul_day - data_modul_hour) / 3600;

let data_modul_minute = data_modul_hour % 60;
let data_minute = (data_modul_hour - data_modul_minute) / 60;

let data_second = data_modul_minute;

alert(`${data_day} օր, ${data_hour} ժամ, ${data_minute} րոպե, ${data_second} վայրկյան`)