// Օգտագործելով անանուն ֆունկցիաներ, լյամբդա արտահայտություններ և զանգվածի հետ աշխատող ֆունկցիաներ իրականացնել հետեւյալ գործողությունները
let x = [5, 7, 17, 64, 23, 74, 96, 75, 41];

// Ամբողջ թվեր պարունակող x զանգվածի յուրաքանչյուր անդամ մեծացնել 10 -ով

console.log("Զանգվածի յուրաքանչյուր անդամ մեծացնել է 10-ով:  " + 
  (x.map((element) => element + 10)));

// Ամբողջ թվեր պարունակող x զանգված-ից առանձնացնել այն տարրերը, որոնք 10-ով բազմապատկելիս ստացվում է 100-ից մեծ թիվ

console.log("Զանգվածի յուրաքանչյուր անդամ մեծացնելիս 10-ով կստանաք 100-ից մեծ թիվ:  " + 
  (x.filter((element) => (element * 10 > 100) ? true : false )));


// Անուններ պարունակող զանգվածը դասավորել այնպես, որ A տառով սկսվող անունները լինեն սկզբում
let n = ['Ani', 'Karen', 'Hamlet', 'Simon', 'Anastas', 'Anna', 'Karen', 'Artur', 'Ararat'];

console.log("Զանգվածի յուրաքանչյուր A տառով սկսվող անունները սկզբում են:  " + 
  n.sort());

// Անուններ պարունակող զանգվածը դասավորել այնպես, որ 7-ից մեծ երկարություն ունեցող անունները լինեն սկզբում
let m = ['Ani', 'Karen', 'Hamlet', 'Simon', 'Anastas', 'Anna', 'Karen', 'Artur', 'Ararat'];

console.log("Զանգվածի յուրաքանչյուր 7-ից մեծ երկարություն ունեցող անունները սկզբում են:  " + 
  (m.sort((a, b) => b.length - a.length)));

// Գրել ֆունկցիա լյամբդա արտահայտության շնորհիվ, որը տրված զանգվածից կհեռացնի բացասական թվերը:
let i = [-5, 8, 17, -6, 41, 50, 20, -6, -8, 4, -1, 0, -8, 57];

console.log("Լյամբդա արտահայտության շնորհիվ զանգվածից հեռացվել են բացասական թվերը:   " +
  i.filter((element) => (element >= 0) ? true : false ));

// Գրել ֆունկցիա լյամբդա արտահայտության շնորհիվ, որը տեքստի յուրաքանչյուր տառից առաջ ավելացնում է բացատ:
let txt = 'Hello my dear friend.';

console.log("Զանգվածի յուրաքանչյուր անդամից առաջ ավելացված է բացատ:  " + 
  txt.split(" ").join("  "));

// Գրել ֆունկցիա լյամբդա արտահայտության շնորհիվ, որը կվերադարձնի զանգվածի այն տարրերը, որոնք 10 - ի բազմապատիկ են:
let k = [27, 0, 10, 15, 25, 66, 70, 95, 80, 142, 100, 154];

console.log("Զանգվածի յուրաքանչյուր անդամ 10 - ի բազմապատիկ է:  " + 
  (k.filter((element) => (element % 10 === 0) ? true : false )));

// Ունենք let z = 987654321; թիվը
// Վերափոխել թիվը տեքստային տիպի և բաժանել զանգվածի, օգտագործելով map մեթոդը
// կենտ թվերը բարձրացնել քառակուսի, իսկ զույգ թվերը՝ խորանարդ
// Ցուցադրել թվերի գումարը։

let z = 987654321;
const z1 = z.toString().split("");
const zMap = z1.map((element) => (element % 2 === 1 ) ? element ** 2 : element ** 3)
const zRez = zMap.reduce((a,b) => a + b ) 

console.log("Զանգվածի կենտ թվերը բարձրացրած քառակուսի, իսկ զույգ թվերը՝ խորանարդ:  " +
  zMap, "Զանգվածի թվերի գումարը:  " + zRez);

console.log((z.toString().split("").map((element) => (element % 2 === 1 ) ? element ** 2 : element ** 3)) + " : " 
+ (z.toString().split("").map((element) => (element % 2 === 1 ) ? element ** 2 : element ** 3)).reduce((a,b) => a + b));
